In [1]:
from pymongo import MongoClient

In [2]:
client = MongoClient()

In [3]:
db = client.sample

In [4]:
for data in db.data.find():
    print(data)

{'_id': ObjectId('5e6b270b92761204287380cc'), 'Id': 1, 'Name': 'Dewanshu Rahul', 'Phone': 987758477, 'Age': 23, 'Address': 'Madhubani'}
{'_id': ObjectId('5e6b270b92761204287380cd'), 'Id': 2, 'Name': 'Nikhil', 'Phone': 877031367, 'Age': 22, 'Address': 'Bhilai'}
{'_id': ObjectId('5e6b270b92761204287380ce'), 'Id': 3, 'Name': 'Nilesh', 'Phone': 987654321, 'Age': 24, 'Address': 'Indor'}

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(list(db.data.find()))

In [7]:
df

                        _id  Id            Name      Phone  Age    Address
0  5e6b270b92761204287380cc   1  Dewanshu Rahul  987758477   23  Madhubani
1  5e6b270b92761204287380cd   2          Nikhil  877031367   22     Bhilai
2  5e6b270b92761204287380ce   3          Nilesh  987654321   24      Indor

In [9]:
if '_id' in df:
    del df['_id']

In [10]:
df

   Id            Name      Phone  Age    Address
0   1  Dewanshu Rahul  987758477   23  Madhubani
1   2          Nikhil  877031367   22     Bhilai
2   3          Nilesh  987654321   24      Indor

In [12]:
df.to_csv('/home/admin1/Desktop/Experiment/MongoExport.csv', sep=',')